app/Http/Controllers/RestorantController.php

select * from `restorants` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `restorants`
---
    public function index(Restorant $restorants)
    {
        if(auth()->user()->hasRole('admin')){
            //return view('restorants.index', ['restorants' => $restorants->where(['active'=>1])->paginate(10)]);
            return view('restorants.index', ['restorants' => $restorants->orderBy('id', 'desc')->paginate(10)]);

insert into `users` (`name`, `email`, `phone`, `active`, `api_token`, `password`, `updated_at`, `created_at`) values ('Aleksandra', 'alekce_d@yahoo.com', '+38978203673', 0, 'NjbEXISKkiojQqThitoFUShLKGK4kJlu6AqnBKP1ikd9bcpFt0pkX0gbTc9LrRB1FDFwk5kbAAay8ccq', '', '2020-09-30 18:20:03', '2020-09-30 18:20:03')
---
    public function storeRegisterRestaurant(Request $request)
    {
        //Validate first
        $request->validate([
            'name' => ['required', 'string', 'unique:restorants,name', 'max:255'],
            'name_owner' => ['required', 'string', 'max:255'],
            'email_owner' => ['required', 'string', 'email', 'unique:users,email', 'max:255'],
            'phone_owner' => ['required', 'string', 'regex:/^([0-9\s\-\+\(\)]*)$/', 'min:10'],
        ]);

        //Create the user
        //$generatedPassword = Str::random(10);
        $owner = new User;
        $owner->name = strip_tags($request->name_owner);
        $owner->email = strip_tags($request->email_owner);
        $owner->phone = strip_tags($request->phone_owner)|"";
        $owner->active = 0;
        $owner->api_token = Str::random(80);



        $owner->password = null;
        $owner->save();