app/Http/Controllers/SettingsController.php

update `settings` set `header_title` = '', `header_subtitle` = '', `mobile_info_subtitle` = 'It`s all at your fingertips - the restaurants you love. Find the right food to suit your mood&#44; and make the first bite last. Go ahead&#44; download us.', `settings`.`updated_at` = '2020-10-01 14:36:26' where `id` = 1
---



        $settings->update();